In [ ]:
import pandas as pd

k = pd.read_excel("tips.xlsx")

In [2]:
print(k)

     total_bill   tip  Gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner   NaN
1         10.34  1.66    Male     No   Sun  Dinner   3.0
2         21.01  3.50    Male     No   Sun  Dinner   3.0
3         23.68  3.31    Male     No   Sun  Dinner   2.0
4         24.59  3.61  Female     No   Sun  Dinner   4.0
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner   3.0
240       27.18  2.00  Female    Yes   Sat  Dinner   2.0
241       22.67  2.00    Male    Yes   Sat  Dinner   2.0
242       17.82  1.75    Male     No   Sat  Dinner   2.0
243       18.78  3.00  Female     No  Thur  Dinner   2.0

[244 rows x 7 columns]

In [ ]:
k[k["tip"]>3]

     total_bill   tip  Gender smoker  day    time  size
2         21.01  3.50    Male     No  Sun  Dinner   3.0
3         23.68  3.31    Male     No  Sun  Dinner   2.0
4         24.59  3.61  Female     No  Sun  Dinner   4.0
5         25.29  4.71    Male     No  Sun  Dinner   4.0
7         26.88  3.12    Male     No  Sun  Dinner   4.0
..          ...   ...     ...    ...  ...     ...   ...
219       30.14  3.09  Female    Yes  Sat  Dinner   4.0
221       13.42  3.48  Female    Yes  Fri   Lunch   2.0
232       11.61  3.39    Male     No  Sat  Dinner   2.0
238       35.83  4.67  Female     No  Sat  Dinner   3.0
239       29.03  5.92    Male     No  Sat  Dinner   3.0

[98 rows x 7 columns]

<h4> Info</h4><br><b>It will tell you the summary

In [7]:
k.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   Gender      244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        241 non-null    float64
dtypes: float64(3), object(4)
memory usage: 13.5+ KB

#### Head 
<B>To see from starting
shows the first 10 rows of the dataframe by default it shows 5 rows

In [ ]:
k.head(10) #shows the first 10 rows of the dataframe by default it shows 5 rows

   total_bill   tip  Gender smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner   NaN
1       10.34  1.66    Male     No  Sun  Dinner   3.0
2       21.01  3.50    Male     No  Sun  Dinner   3.0
3       23.68  3.31    Male     No  Sun  Dinner   2.0
4       24.59  3.61  Female     No  Sun  Dinner   4.0
5       25.29  4.71    Male     No  Sun  Dinner   4.0
6        8.77  2.00    Male     No  Sun  Dinner   NaN
7       26.88  3.12    Male     No  Sun  Dinner   4.0
8       15.04  1.96    Male     No  Sun  Dinner   2.0
9       14.78  3.23    Male     No  Sun  Dinner   2.0

In [ ]:
k.tail(10) #shows the last 10 rows of the dataframegit

     total_bill   tip  Gender smoker   day    time  size
234       15.53  3.00    Male    Yes   Sat  Dinner   2.0
235       10.07  1.25    Male     No   Sat  Dinner   2.0
236       12.60  1.00    Male    Yes   Sat  Dinner   2.0
237       32.83  1.17    Male    Yes   Sat  Dinner   2.0
238       35.83  4.67  Female     No   Sat  Dinner   3.0
239       29.03  5.92    Male     No   Sat  Dinner   3.0
240       27.18  2.00  Female    Yes   Sat  Dinner   2.0
241       22.67  2.00    Male    Yes   Sat  Dinner   2.0
242       17.82  1.75    Male     No   Sat  Dinner   2.0
243       18.78  3.00  Female     No  Thur  Dinner   2.0

#### Describe()
 SHows The statistical summary of the dataframe

In [11]:
k.describe()

       total_bill         tip        size
count  244.000000  244.000000  241.000000
mean    19.785943    2.998279    2.576763
std      8.902412    1.383638    0.954878
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [12]:
k.shape #gives the number of rows and columns in the dataframe

(244, 7)

In [20]:
k.columns #gives the names of the columns in the dataframe
k.head()

   total_bill   tip  Gender smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner   NaN
1       10.34  1.66    Male     No  Sun  Dinner   3.0
2       21.01  3.50    Male     No  Sun  Dinner   3.0
3       23.68  3.31    Male     No  Sun  Dinner   2.0
4       24.59  3.61  Female     No  Sun  Dinner   4.0

In [23]:
df_cleaned = k.dropna() #drops the rows with missing values
df_cleaned.head()

   total_bill   tip  Gender smoker  day    time  size
1       10.34  1.66    Male     No  Sun  Dinner   3.0
2       21.01  3.50    Male     No  Sun  Dinner   3.0
3       23.68  3.31    Male     No  Sun  Dinner   2.0
4       24.59  3.61  Female     No  Sun  Dinner   4.0
5       25.29  4.71    Male     No  Sun  Dinner   4.0

In [22]:
df_filled = k.fillna(0) #fills the missing values with 0
df_filled.head()

   total_bill   tip  Gender smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner   0.0
1       10.34  1.66    Male     No  Sun  Dinner   3.0
2       21.01  3.50    Male     No  Sun  Dinner   3.0
3       23.68  3.31    Male     No  Sun  Dinner   2.0
4       24.59  3.61  Female     No  Sun  Dinner   4.0

In [27]:
df_group = k.groupby("day")["total_bill"].sum() #groups the data by day and calculates the mean of total_bill for each day
print(df_group.head())

day
Fri      325.88
Sat     1778.40
Sun     1627.16
Thur    1096.33
Name: total_bill, dtype: float64

In [25]:
sorted_k = k.sort_values(by="total_bill", ascending=False) #sorts the dataframe by total_bill in descending order
print(sorted_k.head())

     total_bill    tip Gender smoker  day    time  size
170       50.81  10.00   Male    Yes  Sat  Dinner   3.0
212       48.33   9.00   Male     No  Sat  Dinner   4.0
59        48.27   6.73   Male     No  Sat  Dinner   4.0
156       48.17   5.00   Male     No  Sun  Dinner   6.0
182       45.35   3.50   Male    Yes  Sun  Dinner   3.0

In [26]:
k['total_bill_in hunders'] = k["total_bill"].apply(lambda x: x/100) #creates a new column total_bill_in hunders by applying a lambda function to total_bill column
print(k.head())

   total_bill   tip  Gender smoker  day    time  size  total_bill_in hunders
0       16.99  1.01  Female     No  Sun  Dinner   NaN                 0.1699
1       10.34  1.66    Male     No  Sun  Dinner   3.0                 0.1034
2       21.01  3.50    Male     No  Sun  Dinner   3.0                 0.2101
3       23.68  3.31    Male     No  Sun  Dinner   2.0                 0.2368
4       24.59  3.61  Female     No  Sun  Dinner   4.0                 0.2459

In [29]:
k_merged = pd.merge(k, df_group, on="day", how="left") #merges the original dataframe with the grouped dataframe on the day column using left join
print(k_merged.head())

   total_bill_x   tip  Gender smoker  day    time  size  \
0         16.99  1.01  Female     No  Sun  Dinner   NaN
1         10.34  1.66    Male     No  Sun  Dinner   3.0
2         21.01  3.50    Male     No  Sun  Dinner   3.0
3         23.68  3.31    Male     No  Sun  Dinner   2.0
4         24.59  3.61  Female     No  Sun  Dinner   4.0

   total_bill_in hunders  total_bill_y
0                 0.1699       1627.16
1                 0.1034       1627.16
2                 0.2101       1627.16
3                 0.2368       1627.16
4                 0.2459       1627.16

In [30]:
!git commit -m "Added more code to my project"
!git push origin main

[main 4e27fbb] Added more code to my project
 1 file changed, 65 insertions(+), 4 deletions(-)

To https://github.com/harsh4214/Foundation-of-Machine-Learning.git
   ef302fe..4e27fbb  main -> main

#### Pivot Table

In [33]:
pivot_table  = k.pivot_table(values="total_bill", index="day", columns="Gender", aggfunc="mean") #creates a pivot table with total_bill as values
pivot_table.head()

Gender     Female       Male
day
Fri     14.145556  19.857000
Sat     19.680357  20.802542
Sun     19.872222  21.887241
Thur    16.715312  18.714667

#### Acessing a columnn

In [35]:
k["total_bill"].head() #calculates the mean of total_bill column

0    16.99
1    10.34
2    21.01
3    23.68
4    24.59
Name: total_bill, dtype: float64

#### Filtering using loc

In [36]:
filtered_k = k.loc[k["total_bill"] > 20] #filters the dataframe to include only rows where total_bill is greater than 20
print(filtered_k.head())

   total_bill   tip  Gender smoker  day    time  size  total_bill_in hunders
2       21.01  3.50    Male     No  Sun  Dinner   3.0                 0.2101
3       23.68  3.31    Male     No  Sun  Dinner   2.0                 0.2368
4       24.59  3.61  Female     No  Sun  Dinner   4.0                 0.2459
5       25.29  4.71    Male     No  Sun  Dinner   4.0                 0.2529
7       26.88  3.12    Male     No  Sun  Dinner   4.0                 0.2688

#### Accessing the rows with iloc

In [38]:
k.iloc[0:5] #accesses the first 5 rows of the dataframe using iloc

   total_bill   tip  Gender smoker  day    time  size  total_bill_in hunders
0       16.99  1.01  Female     No  Sun  Dinner   NaN                 0.1699
1       10.34  1.66    Male     No  Sun  Dinner   3.0                 0.1034
2       21.01  3.50    Male     No  Sun  Dinner   3.0                 0.2101
3       23.68  3.31    Male     No  Sun  Dinner   2.0                 0.2368
4       24.59  3.61  Female     No  Sun  Dinner   4.0                 0.2459